# 리스트 기초

# ===========================================================
#  컬렉션 자료형: ( 리스트 ), ( 튜플 ), ( 딕셔너리 ), ( 셋 )
# ===========================================================

# ===========================================================
#  리스트 (list): 여러 객체를 순서가 있는 컬렉션으로 묶어 저장하는 변경 가능한 자료형
#  리스트 특징
#  1. ( mutable , 변경 가능 ) -> 문자열과의 차이점
#  2. ( iterable , 반복 가능 )
#  3. ( sequence , 인덱싱과 슬라이싱 가능 )
#  4. ( 중복 허용 )
# ===========================================================

# 리스트 생성
a = []
b = list()
print(type(a), type(b))

a = [1, 3.14, "Python", True]
print(a)

s = "python"
print(list(s))


# ===========================================================
# 1. 리스트는 mutable하다. (변경 가능)
# ===========================================================
print(id(a), a)
a[0] = 10
print(a)
print(id(a)) 




# ===========================================================
# 2. 리스트는 iterable하다. (반복 가능)
# ===========================================================

# 리스트 순회
for data in a:
    print(data)

for i, data in enumerate(a): #index와 data를 동시에 가져오기
    print(i, data)


# ===========================================================
# 3. 리스트는 sequence 자료형이다. (인덱싱, 슬라이싱 가능)
# ===========================================================

# 인덱싱
print(a[0])
print(a[-1])

# 슬라이싱
print(a[:2]) # 앞에서 2개 출력 (10, 3.14)
print(a[1:3]) # 중간 2개 출력 (3.14, "True")
print(a[::-1]) # 거꾸로 출력 (10, "True", 3.14, 10)




# ===========================================================
# 4. 리스트는 중복을 허용한다. (같은 값을 여러번 담을 수 있음)
# ===========================================================
a = [10, 10, 10]
print(a)



# ===========================================================
#  파이썬 내장 함수
# ===========================================================

a = [3, 4, 1, 5, 2]

print(len(a)) # 길이
print(sum(a)) # 합계
print(max(a)) # 최대값
print(min(a)) # 최소값
print(sorted(a)) # 정렬 (오름차순)
print(id(b))
print(sorted(a, reverse=True)) # 정렬 (내림차순)

# 리스트 합치기
print(a + [10, 20])

# "+" 연산은 문자열과 동일하게 새로운 리스트 객체를 만듦
# 원본을 바꾸려면 리스트 메소드 사용하기
a.append(10) # 맨 뒤에 추가
print(a)

a.extend([20, 30]) # 여러개 추가
print(a)

# 리스트 반복하기


# 멤버십 연산자