# 튜플 기초

# ===========================================================
#  튜플 (tuple): 여러 객체를 순서가 있는 컬렉션으로 묶어 저장하는 변경 불가능한 자료형
#  튜플의 특징
#  1. (  ) -> 리스트와의 차이점
#  2. ( immutable )
#  3. ( 인덱싱, 슬라이싱 가능 )
#  4. ( 중복가능 )
# ===========================================================

# 튜플 생성
a = ()
b = tuple()
print(type(a), type(b))

t = 1, 3.14, True, "Hello", [1, 2, 3], (4, 5, 6)
print(t, type(t))

a = 1
b = 1,
print(type(a), type(b))
# ===========================================================
# 1. 튜플은 immutable하다. (변경 불가능)
# ===========================================================
# t[0] = 10                         # __setitem__() 메소드가 없기 때문에 에러 발생
# tuple.__setitem__(t, 0, 10)       # __setitem__() 메소드가 없기 때문에 에러 발생
# list.__setitem__                  # 리스트는 __setitem__() 메소드가 있기 때문에 가능

t = (1, [2,3])
t[1].append(4)
print(t)

# ===========================================================
# 2. 튜플은 iterable하다. (반복 가능)
# ===========================================================

t = (10, 20, 30, 40)

# 튜플 순회



# ===========================================================
# 3. 튜플은 sequence 자료형이다. (인덱싱, 슬라이싱 가능)
# ===========================================================

# 인덱싱
                         # 첫번째 요소 출력
                        # 마지막 요소 출력

# 슬라이싱
                        # 앞에서 2개 출력
                       # 중간 2개 출력
                      # 거꾸로 출력


# ===========================================================
# 4. 튜플은 중복을 허용한다. (같은 값을 여러번 담을 수 있음)
# ===========================================================




# ===========================================================
#  파이썬 내장 함수
# ===========================================================

a = (3, 4, 1, 5, 2)


# 튜플 합치기


# 튜플은 원본 불가이므로, 원본을 바꾸는 extend, append 메소드가 없음

# 튜플 반복하기


# 멤버십 연산자