# 집합 기초

# ===========================================================
#  집합 (set): 여러 객체를 순서 없이 중복을 허용하지 않고 저장하는 변경 가능한 자료형
#  집합의 특징
#  1. ( mutable, 변경 가능 )
#  2. ( iterable, 반복 가능 )
#  3. ( not sequence, 인덱싱과 슬라이싱 불가 )
#  4. ( unique elements, 중복 불가 )
# ===========================================================

# 집합 생성
s1 = {1, 2, 3, 3}
s2 = set([1, 2, 3, 3])
empty_set = set()
print(s1)
print(s2)
print(empty_set)


# ===========================================================
# 1. 집합은 mutable하다. (변경 가능)
# ===========================================================

s = {1, 2, 3}
s.add(4)
print(s)

s.remove(2)
print(s)

s.discard(10)
print(s)

s.update([5, 6])
print(s)



# ===========================================================
# 2. 집합은 iterable하다. (반복 가능)
# ===========================================================

# 집합 순회

s = {10, 20, 30}
for value in s:
	print(value)


# ===========================================================
# 3. 집합은 sequence 객체가 아니다. (인덱싱, 슬라이싱 불가)
# ===========================================================

s = {10, 20, 30}
try:
	print(s[0])
except TypeError:
	print("집합은 인덱싱할 수 없습니다.")

try:
	print(s[0:2])
except TypeError:
	print("집합은 슬라이싱할 수 없습니다.")


# ===========================================================
# 4. 집합은 중복을 허용하지 않는다.
# ===========================================================

s = {1, 1, 2, 2, 3, 3}
print(s)


# ===========================================================
#  파이썬 내장 함수
# ===========================================================

s = {4, 1, 3, 2}
print(len(s))
print(min(s))
print(max(s))
print(sum(s))
print(sorted(s))



# 집합 합치기
s = {1, 2, 3}
t = {3, 4, 5}
print(s | t)


# 집합 반복하기
for value in sorted(s | t):
	print(value)


# 멤버십 연산자
print(2 in s)
print(10 not in s)